haliwt/Drv8302_mkv46f256vlh16_servo/main.c
			    else if(wipers_s == 3)
                 {
                     WIPER_OUTPUT_1 = 3;   
                
                    printf("WIPERS  = 3 @@@~~~~@@@\r\n");
                  }
                else
                 {
                     wipers_s =0;
                      WIPER_OUTPUT_1 = 0;   
                    
                      printf("WIPERS  = 0 @@@~~~~@@@~~~~\r\n");
                 }
             }
		     /*******************AIR_F***************************/   
              if(ucConKeyValue == 0x12)
			 {
                 AIR_OUTPUT = 1;
                
				printf("AIR  = 1 ~~@@@~~\r\n");
			 }
              if(ucConKeyValue == 0x13)
			 {
                 AIR_OUTPUT = 0;
                
				printf("AIR  = 0 ~~@@@~~@@@~~~~@@@\r\n");
			 }
        }
		else
		{
			/* 3?ê± */
			LED1=!LED1;
			
		}

     taskYIELD();// // vTaskDelayUntil(&xLastWakeTime, xFrequency); // vTaskDelay(xMaxBlockTime); 
	}
}
/*********************************************************************************************************
*	函 数 名: vTaskBLDC
*	功能说明: 使用函数xQueueReceive接收任务vTaskTaskUserIF发送的消息队列数据(xQueue2)	
*	形    参: pvParameters 是在创建该任务时传递的形参
*	返 回 值: 无
*   优 先 级: 3  
*********************************************************************************************************/
static void vTaskBLDC(void *pvParameters)
{
    uint8_t txbuff[]="vTaskBLDC 3";
    uint32_t ucValue;
   
	//TickType_t xLastWakeTime;
	
//	const TickType_t xFrequency = 100;
  //  xLastWakeTime = xTaskGetTickCount();
    volatile uint16_t pwm_f=0;
	uint16_t sampleMask;
	BaseType_t xResult;
    const TickType_t xMaxBlockTime = pdMS_TO_TICKS(100); /* 设置最大等待时间为300ms */
	uint32_t ucConValue;
    uint16_t dirvalue;
	uint8_t vTasktx1[]="BLDC receive success!!";
    uint8_t vTask[]="ABC_= 1 @@@@~~~@@@\r\n";
    uint8_t vBLDCtx2[] = "Motor Run is OK !!!!";
    uint8_t printx1[]="Dir = Dir is OK !!!! CW \r\n";
    uint8_t printx2[]="Dir = - Dir is OK #### CCW \r\n";
	while(1)
    {       
        
        //printf("vTaskBLDC-2 \r\n");  
        UART_WriteBlocking(DEMO_UART,txbuff,sizeof(txbuff)-1);
        xResult = xTaskNotifyWait(0x00000000,      
						          0xFFFFFFFF,      
						          &ucConValue,        /* 存储ulNotifiedValue在ulvalue中 */
						          xMaxBlockTime);  /* 最大延迟时间 */
	  if(xResult == pdPASS)
		{
			/* 接收数据成功 */
          //printf("vTaskBLDC ConmessageID = %#x\r\n",ucConValue );
           UART_WriteBlocking(DEMO_UART,vTasktx1,sizeof(vTasktx1)-1);
		  ucValue = ucConValue ;
		}
		else
		{
			/* 超时 */
          LED2= !LED2;
		}
     #if 0 
      if(ucValue == 0x01)
      {
         A_POWER_OUTPUT =1;
		 B_POWER_OUTPUT =1;
		 C_POWER_OUTPUT =1;
        // printf("ABC_= 1 @@@@~~~@@@\r\n");
         UART_WriteBlocking(DEMO_UART,vTask,sizeof(vTask)-1);
		 
	  }
	  else if(ucValue == 0x02)
	  {

         A_POWER_OUTPUT =0;
		 B_POWER_OUTPUT =0;
		 C_POWER_OUTPUT =0;
		printf("ABC_= 0 ~~~~~~~~~\r\n");  
	  }
	  #endif 

		
	  if((ucValue==0xa1)|| (recoder_number.break_f ==1))//刹车
	  {
       
        
           
         taskENTER_CRITICAL(); //进入临界状态
		 PMW_AllClose_ABC_Channel();
         PMW_AllClose_ABC_Channel();
		
		 if(recoder_number.break_f ==1)
		 {
		     A_POWER_OUTPUT =0;
			  
		  }
		 taskEXIT_CRITICAL(); //退出临界状态
		 
		 //printf("Break is OK $$$$$$$$$$$$$\r\n");
        
	  }
	  else if(ucValue==0xa0)  
	  { 
            
            /* 接收数据成功 */
             printf("Motor run = %#x\r\n",ucConValue);
			// printf("Motor Run is OK !!!!\r\n");
             UART_WriteBlocking(DEMO_UART,vBLDCtx2,sizeof(vBLDCtx2)-1);

	       /**********************adjust frequency ****************************/
			{
            
		    CADC_DoSoftwareTriggerConverter(CADC_BASEADDR, kCADC_ConverterA);
	             /* Wait the conversion to be done. */
	         while (kCADC_ConverterAEndOfScanFlag !=
	               (kCADC_ConverterAEndOfScanFlag & CADC_GetStatusFlags(CADC_BASEADDR)))
	        {
	        }

	        /* Read the result value. */
	        if (sampleMask == (sampleMask & CADC_GetSampleReadyStatusFlags(CADC_BASEADDR)))
	        {
              //  pwm_f =(int16_t)CADC_GetSampleResultValue(CADC_BASEADDR, 1U);
		      //   PRINTF("%d\t\t",pwm_f );
	           
			 // DelayMs(100U);
             // pwm_f = (uint16_t)((CADC_GetSampleResultValue(CADC_BASEADDR, 1U))/ 330);
	         // PRINTF("PWM_Duty = %d\r\n",pwm_f);
			 // DelayMs(200U);
	           
            }
            CADC_ClearStatusFlags(CADC_BASEADDR, kCADC_ConverterAEndOfScanFlag);

     	    }

            pwm_f = (uint16_t)((CADC_GetSampleResultValue(CADC_BASEADDR, 1U))/ 330);
            //PRINTF("PWM_Duty = %d\r\n",pwm_f);
            
			if(recoder_number.dir_change == 1) 
            {
                  dirvalue = 1 ;
				 // printf("Dir = Dir is OK !!!! CW \r\n");
				  UART_WriteBlocking(DEMO_UART,printx1,sizeof(printx1)-1);
			}
			else 
			{
			    dirvalue = 0;
				//printf("Dir = - Dir is OK #######\r\n");
				UART_WriteBlocking(DEMO_UART,printx2,sizeof(printx2)-1);
			}
			/***********Motor Run**************/
          //  PMW_AllClose_ABC_Channel();
			 uwStep = HallSensor_GetPinState();
        	PRINTF("ouread = %d \r\n",uwStep);
        	
        	
        	HALLSensor_Detected_BLDC(uwStep,pwm_f,dirvalue); 
           

        }
	
      taskYIELD();// // vTaskDelayUntil(&xLastWakeTime, xFrequency); // vTaskDelay(xMaxBlockTime);         
      }
 } 

/*********************************************************************************************************
*
*	函 数 名: vTaskCOTL
*	功能说明: 接收物理按键和数字按键的命令
*	形    参: pvParameters 是在创建该任务时传递的形参
*	返 回 值: 无
*   优 先 级: 4  
*
*********************************************************************************************************/
static void vTaskCOTL(void *pvParameters)
{
   
     uint8_t ucKeyCode=0,abc_s=0,digital_s=0;
     uint8_t start_s =0,door_s = 0,wiper_s=0,air_s=0;
     uint8_t hall_s = 0,wheel_s=0,abc_power_s=0;
     
     TickType_t xLastWakeTime;

    const TickType_t xFrequency = 200;
    xLastWakeTime = xTaskGetTickCount();
    BaseType_t xResult;
	const TickType_t xMaxBlockTime = pdMS_TO_TICKS(100); /* 设置最大等待时间为5ms */
	uint8_t ucControl=0;
	uint32_t rlValue,ulValue;
	

	while(1)
    {
	      printf("vTaskCOTL-3 \r\n");
          
		   ucKeyCode = KEY_Scan(0);
           
           if(GPIO_PinRead(SD315AI_SO1_A_GPIO,SD315AI_SO1_A_PIN)==1 ||GPIO_PinRead(SD315AI_SO2_A_GPIO,SD315AI_SO1_A_PIN)==1)
          {
               GPIO_PinWrite(SD315AI_VL_A_GPIO,SD315AI_VL_A_PIN,1);//SD315_VL_A_OUTPUT=0;
              // GPIO_PinWrite(SD315AI_VL_B_GPIO,SD315AI_VL_B_PIN,1);//SD315_VL_B_OUTPUT=0;
            

