haliwt/Drv8302_mkv46f256vlh16_servo/main.c
          }
          if(SD315AI_SO1_B_INPUT == 1 || SD315AI_SO2_B_INPUT == 1)
          {
               
               GPIO_PinWrite(SD315AI_VL_B_GPIO,SD315AI_VL_B_PIN,1);//SD315_VL_B_OUTPUT=0;
            

          }
            if(SD315AI_SO1_C_INPUT == 1 || SD315AI_SO2_C_INPUT == 1)
          {
                GPIO_PinWrite(SD315AI_VL_C_GPIO,SD315AI_VL_C_PIN,1);
               
              
          }
		  xResult = xTaskNotifyWait(0x00000000,      
						            0xFFFFFFFF,      
						            &rlValue,        /* 存储ulNotifiedValue在ulvalue中 */
						            xMaxBlockTime);  /* 最大延迟时间 */
		
		if( xResult == pdPASS )
		{
            ulValue=rlValue;
			printf("vTaskCOTL = %#x\r\n", ulValue);
			/****************digitalkey coder******************/
			 if(ulValue == 0x01)
			 {
                ucKeyCode =ABC_POWER_PRES  ; 
			 }
			 if(ulValue == 0x2)
			 {
                ucKeyCode =START_PRES  ; 
			 }
			 if(ulValue == 0x4)
			 {
                ucKeyCode =DIR_PRES  ; 
			 }
			 if(ulValue == 0x07)
			 {
                ucKeyCode =DIGITAL_ADD_PRES  ; 
			 }
			 if(ulValue == 0x06)
			 {
                ucKeyCode =DIGITAL_REDUCE_PRES  ; 
			 }
			 if(ulValue == 0x09)
			 {
                ucKeyCode =DOOR_PRES ; 
			 }
			 if(ulValue == 0x0a)
			 {
                ucKeyCode =HALL_PRES ; 
			 }
			 if(ulValue == 0x0c)
			 {
                ucKeyCode =WHEEL_PRES ; 
			 }
			  if(ulValue == 0x0e)
			 {
                ucKeyCode =WIPERS_PRES ; 
			 }
			  if(ulValue == 0x12)
			 {
                ucKeyCode =AIR_PRES ; 
			 }
			 
		}
		else
		{
			/* 3?ê± */
			LED1=0;
			LED2 =0 ;
		}

      /*处理接收到的按键功能*/  
		if(ucKeyCode !=KEY_UP) 
				
			{
               switch(ucKeyCode)//if(ptMsg->ucMessageID == 0x32)
                { 
                 
                  case ABC_POWER_PRES :

				  PRINTF("ABC_PRES key \r\n");
				     abc_power_s++;
				  if((abc_power_s ==1)||(recoder_number.break_f==1))
				  	{
                       ucControl = 0x01;
                       abc_s ++;
                       if(abc_s == 255) abc_s =3;
                       if(recoder_number.break_f ==1)
                       {
                            recoder_number.break_f=0;
                            abc_s =2;
                       }
                       xTaskNotify(xHandleTaskSUBJ ,          //xHandleTaskBLDC,        /* 目标任务 */
                                   ucControl,              /* 发送数据 */
                                   eSetValueWithOverwrite);/* 上次目标任务没有执行，会被覆盖 */
                       printf("ABC POWER IS SEND WORKS \n");
                     }
					else 
					{
                     ucControl = 0x01;
                     abc_power_s =0 ;
                     xTaskNotify( xHandleTaskSUBJ ,//xHandleTaskBLDC,        /* 目标任务 */
                                 ucControl,              /* 发送数据 */
                                 eSetValueWithOverwrite);/* 上次目标任务没有执行，会被覆盖 */
                     printf("ABC POWER IS STOP \n");

					}
				  	break;

				 case START_PRES:
                   PRINTF("START_PRES key \r\n");
				    start_s ++;
		          if(((start_s == 1)||(abc_s ==2))&&(abc_s!=0))
		          {
                    
                     ucControl =0xa0;
                     abc_s =5; ;
    				 recoder_number.break_f=0;
    				 xTaskNotify(xHandleTaskBLDC,      /* 目标任务 */
    								ucControl,              /* 发送数据 */
    								eSetValueWithOverwrite);/* 上次目标任务没有执行，会被覆盖 */
                    printf("START KEY IS SEND WORKS \n");
				  }
				  else 
				  {
                     ucControl = 0xa1;
					 start_s =0;
					  xTaskNotify(xHandleTaskBLDC,      /* 目标任务 */
									ucControl,              /* 发送数据 */
									eSetValueWithOverwrite);/* 上次目标任务没有执行，会被覆盖 */
					 printf("START KEY IS STOP\n");
				  }
                 
				  break;
				  
				 case DIR_PRES: //3

			      recoder_number.dir_change++;
	  			 PRINTF(" DIR_change = %d  \r\n", recoder_number.dir_change);
	  			 if(recoder_number.dir_change == 1)
	   				{
                        LED1 =0;
						LED2 =0;
				    }
				 else 
				   {
                      recoder_number.dir_change =0;
					  
				   }
			
           		break;
				
			 case DIGITAL_ADD_PRES ://4
				PRINTF("DIGITAL_ADD_PRES key \r\n");
                  digital_s ++;
				 if(digital_s ==1)
				  	{
                       ucControl = 0x01;
                       xTaskNotify(xHandleTaskSUBJ,      /* 目标任务 */
                                   ucControl,              /* 发送数据 */
                                   eSetValueWithOverwrite);/* 上次目标任务没有执行，会被覆盖 */
                     }
					else 
					{
                     ucControl = 0x00;
                     digital_s =0 ;
                     xTaskNotify(xHandleTaskSUBJ,      /* 目标任务 */
                           ucControl,              /* 发送数据 */
                           eSetValueWithOverwrite);/* 上次目标任务没有执行，会被覆盖 */

					}
				break;
				
			 case DIGITAL_REDUCE_PRES ://5 PAT13
			 	PRINTF("DIGITAL_REDUCE_PRES key \r\n");
                digital_s ++;
			     if((digital_s ==1)||(recoder_number.break_f ==1))
				   {
                      recoder_number.break_f =0;
					//  abc_power_s=1;
					  ucControl = 0x05;
					  xTaskNotify(xHandleTaskBLDC,		/* 目标任务 */
								  ucControl,			  /* 发送数据 */
								  eSetValueWithOverwrite);/* 上次目标任务没有执行，会被覆盖 */
					}
				   else 
				   {
                     //abc_power_s=0;
					ucControl = 0x04;
					digital_s =0 ;
					xTaskNotify(xHandleTaskBLDC,	  /* 目标任务 */
						  ucControl,			  /* 发送数据 */
						  eSetValueWithOverwrite);/* 上次目标任务没有执行，会被覆盖 */
				   	}
				
				break;
				
			 case DOOR_PRES ://6
			 	   PRINTF("DOOR_PRES key \r\n");
			 	   door_s ++; ;
				   if(door_s ==1)
				   {
                      
                       ucControl = 0x09;
					
					  xTaskNotify(xHandleTaskSUBJ,      /* 目标任务 */
								   ucControl,              /* 发送数据 */
								   eSetValueWithOverwrite);/* 上次目标任务没有执行，会被覆盖 */
				   }
				   else
				   {
                      door_s =0; 
                     ucControl = 0x08;
					  xTaskNotify(xHandleTaskSUBJ,      /* 目标任务 */
								   ucControl,              /* 发送数据 */
								   eSetValueWithOverwrite);/* 上次目标任务没有执行，会被覆盖 */
                    }
			 	   
				break;
				   
			 case HALL_PRES://7
			 	PRINTF("HALL_PRES key \r\n");
				  hall_s ++ ;
				   if(hall_s ==1)
				   {
                      
