haliwt/Drv8302_mkv46f256vlh16_servo/main.c
                       ucControl = 0x0b;
					
					  xTaskNotify(xHandleTaskSUBJ,      /* 目标任务 */
								   ucControl,              /* 发送数据 */
								   eSetValueWithOverwrite);/* 上次目标任务没有执行，会被覆盖 */
				   }
				   else
				   {
            		  hall_s = 0;
					  ucControl = 0x0a;
					  xTaskNotify(xHandleTaskSUBJ,      /* 目标任务 */
								   ucControl,              /* 发送数据 */
								   eSetValueWithOverwrite);/* 上次目标任务没有执行，会被覆盖 */
                   }
				break;
			 
			 case WHEEL_PRES : //8 PTA5
			    PRINTF("WHEEL_PRES key \r\n");
				  wheel_s ++ ;
				 
			    break;
				
			 case WIPERS_PRES: //9雨刮器
			  	PRINTF("WIPERS_PRES key \r\n");
				wiper_s ++;
				
				if(wiper_s ==1)
				{

                   ucControl = 0x0e;
				   xTaskNotify(xHandleTaskSUBJ,      /* 目标任务 */
							   ucControl,              /* 发送数据 */
							   eSetValueWithOverwrite);/* 上次目标任务没有执行，会被覆盖 */
				}
				else if(wiper_s ==2)
				{
                    ucControl = 0x0f;
					xTaskNotify(xHandleTaskSUBJ,      /* 目标任务 */
								ucControl,              /* 发送数据 */
								eSetValueWithOverwrite);/* 上次目标任务没有执行，会被覆盖 */
				 }
				else if(wiper_s == 3)
			    {
					ucControl = 0x10;
					xTaskNotify(xHandleTaskSUBJ,      /* 目标任务 */
								ucControl,              /* 发送数据 */
								eSetValueWithOverwrite);/* 上次目标任务没有执行，会被覆盖 */
				}
				else
				{
                    wiper_s = 0;
					ucControl = 0x11;
					xTaskNotify(xHandleTaskSUBJ,      /* 目标任务 */
								ucControl,              /* 发送数据 */
								eSetValueWithOverwrite);/* 上次目标任务没有执行，会被覆盖 */
				}
             break;
				
	         case AIR_PRES : //10 PE29
	         	PRINTF("AIR_PRES key \r\n");
	            air_s ++;
				        
				if(air_s ==1)
				{
			        ucControl = 0x12;
					xTaskNotify(xHandleTaskSUBJ,      /* 目标任务 */
								ucControl,              /* 发送数据 */
								eSetValueWithOverwrite);/* 上次目标任务没有执行，会被覆盖 */
				}	  
			    else 
			    {
		            air_s =0;
				    ucControl = 0x13;
					xTaskNotify(xHandleTaskSUBJ,      /* 目标任务 */
								ucControl,              /* 发送数据 */
								eSetValueWithOverwrite);/* 上次目标任务没有执行，会被覆盖 */
				  
				   
			    }
                break;
        }
        
	}
      vTaskDelayUntil(&xLastWakeTime, xFrequency);//taskYIELD();//
   }//end whilt(1)
}
/********************************************************************************************************
*	函 数 名: AppTaskCreate
*	功能说明: 创建应用任务
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************/
static void AppTaskCreate (void)
{
    xTaskCreate( vTaskUSART,   									/* 任务函数  */
                 "vTaskUserIF",     							/* 任务名    */
                 configMINIMAL_STACK_SIZE + 166,               	/* 任务栈大小，单位word，也就是4字节 */
                 NULL,              							/* 任务参数  */
                 tskIDLE_PRIORITY+1,                 			/* 任务优先级 最低*/
                 &xHandleTaskUSART );  							/* 任务句柄  */

	xTaskCreate( vTaskSUBJ,    									/* 任务函数  */
                 "vTaskBLDC",  									/* 任务名    */
                 configMINIMAL_STACK_SIZE + 166,         		/* stack大小，单位word，也就是4字节 */
                 NULL,        									/* 任务参数  */
                 tskIDLE_PRIORITY+2,           					/* 任务优先级*/
                 &xHandleTaskSUBJ); 							/* 任务句柄  */
	
	xTaskCreate( vTaskBLDC,    									/* 任务函数  */
                 "vTaskBLDC",  									/* 任务名    */
                 configMINIMAL_STACK_SIZE + 934,         		/* stack大小，单位word，也就是4字节 */
                 NULL,        									/* 任务参数  */
                 tskIDLE_PRIORITY+3,           					/* 任务优先级*/
                 &xHandleTaskBLDC); 							/* 任务句柄  */

	xTaskCreate( vTaskCOTL,    									/* 任务函数  */
                 "vTaskCOTL",  									/* 任务名    */
                 configMINIMAL_STACK_SIZE + 166,         		/* stack大小，单位word，也就是4字节 */
                 NULL,        									/* 任务参数  */
                 tskIDLE_PRIORITY+4,           					/* 任务优先级*/
                 &xHandleTaskCOTL); 							/* 任务句柄  */

}
/********************************************************************
 *
 *	函 数 名: AppObjCreate
 *	功能说明: 创建任务通信机制
 *	形    参: 无
 *	返 回 值: 无
 *
********************************************************************/
#if 0
static void AppObjCreate (void)
{
  
    /* 创建10个uint8_t型消息队列 */
	xQueue1 = xQueueCreate(10, sizeof(uint8_t));
    if( xQueue1 == 0 )
    {
       printf("xQueuel set up fail!!!!"); 
       /* 没有创建成功，用户可以在这里加入创建失败的处理机制 */
    }
    #if 0
     /* 创建10个存储指针变量的消息队列，由于CM3/CM4内核是32位机，一个指针变量占用4个字节 */
	xQueue2 = xQueueCreate(10, sizeof(struct Msg *));
    if( xQueue2 == 0 )
    {
         printf("xQueue2 set up fail!!!!"); /* 没有创建成功，用户可以在这里加入创建失败的处理机制 */
    }
    #endif 

}
#endif 
/******************************************************************************
 *
 * Function Name:BARKE_KEY_IRQ_HANDLER(void)
 * Function Active: Interrpt brake input key 
 * @brief Interrupt service fuction of switch.
 *
 * This function toggles the LED
 *
******************************************************************************/
#if 1
void BARKE_KEY_IRQ_HANDLER(void )//void BOARD_BRAKE_IRQ_HANDLER(void)
{
  
    /* Clear external interrupt flag. */
    GPIO_PortClearInterruptFlags(BRAKE_KEY_GPIO, 1U << BRAKE_KEY_GPIO_PIN );
    /* Change state of button. */

	recoder_number.break_f =1;
	PRINTF("interrupte has happed  \r\n");
	                  
/* Add for ARM errata 838869, affects Cortex-M4, Cortex-M4F Store immediate overlapping
  exception return operation might vector to incorrect interrupt */
#if defined __CORTEX_M && (__CORTEX_M == 4U)
    __DSB();
#endif
}
#endif 


